#+TITLE: Elisp tutorial


*** Useful tips
 - concat: links two or more strings to produce a new one. Arguments are
   strings. (concat "abc" "def")
 - substring: returns a part of a string. Uses strings and numbers as
   arguments. First the string, second and third beginning and end of
   substring. (substring "The quick brown fox jumped." 16 19)
 - An argument can be a variable of a value of an list evaluation.
 (concat "The " (number-to-string (+ 2 fill-column)) " red foxes.")
 - message: printed in the echo area.

#+BEGIN_SRC emacs-lisp
(message "The name of this buffer is %s." (buffer-name))
#+END_SRC  

#+BEGIN_SRC emacs-lisp
(message "He saw %d %s"
         (- fill-column 32)
         (concat "red "
                 (substring
                  "The quick brown foxes jumped." 16 21)
                 " leaping."))
#+END_SRC

#+RESULTS:
: He saw 47 red foxes leaping.
*** Counting
Example of using ~setq~ in a counter

#+BEGIN_SRC emacs-lisp
(setq counter 0)  ; Initializer
(setq counter (+ counter 1))  ; Incrementer
counter  ; Counter
#+END_SRC

#+RESULTS:
: 1

*** Exercise 3
Create a counter that increments by two rather than one.

#+BEGIN_SRC emacs-lisp
(setq counter 0)
(setq counter (+ counter 2))
counter
#+END_SRC

#+RESULTS:
: 2

*** Exercise 4
Write an expression that prints a message in the echo area when evaluated.
#+BEGIN_SRC emacs-lisp :var counter=1
(message "I have run this line %d times so far" (setq counter (+ counter 1)))
#+END_SRC

#+RESULTS:
: I have run this line 2 times so far

*** Template for using it

     (save-excursion
       BODY…)

Often occurs inside a ~let~ expression

     (let VARLIST
       (save-excursion
         BODY…))

#+BEGIN_SRC emacs-lisp
(message "We are %d characters into this buffer."
         (- (point)
            (save-excursion
              (goto-char (point-min)) (point))))
#+END_SRC

#+RESULTS:
: We are 12613 characters into this buffer.

*** Exercise 1
Write a non-interactive function that doubles the value of its argument, a
number.  Make that function interactive.

#+BEGIN_SRC emacs-lisp

(defun double (number)
  "Doubles the value of the argument"
  (* 2 number)
  )

(defun double-interactive (number)
  "Doubles the value of the argument"
  (interactive "p")
  (message "The result is %d" (* 2 number))
  )

(double 3)
#+END_SRC

#+RESULTS:
: 6

*** Exercise 2
Write a function that tests whether the current value of ~fill-column~ is
greater than the argument passed to the function, and if so, prints an
appropriate message.

#+BEGIN_SRC emacs-lisp
(defun carlos-greater-than-fill-column-p (value)
  "Test whether VALUE is greater than 'fill-column'."
  (if (> value fill-column)
      (message "%d is greater than %s" value 'fill-column)
    (message "%s is greater than %d" 'fill-column value)
    )
  )

(carlos-greater-than-fill-column-p 87)
#+END_SRC

#+RESULTS:
: 87 is greater than fill-column




